COMP4650.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>COMP4650</title>
<!-- 2017-07-24 Mon 21:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Robert 'Probie' Offner" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">COMP4650</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Lecture 1</a>
<ul>
<li><a href="#sec-1-1">1.1. History of writing</a></li>
<li><a href="#sec-1-2">1.2. How to automatically process such huge amounts of data</a></li>
<li><a href="#sec-1-3">1.3. Topic 1: Information retrieval</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Boolean retrieval</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Topic 2: Machine learning</a></li>
<li><a href="#sec-1-5">1.5. Topic 3: Social media analysis</a></li>
<li><a href="#sec-1-6">1.6. Topic 4: NLP</a></li>
<li><a href="#sec-1-7">1.7. Topic 5: Information extraction</a></li>
<li><a href="#sec-1-8">1.8. What other applications</a></li>
<li><a href="#sec-1-9">1.9. Course logistics</a></li>
<li><a href="#sec-1-10">1.10. Textbook</a></li>
<li><a href="#sec-1-11">1.11. Lectures</a></li>
<li><a href="#sec-1-12">1.12. Labs</a>
<ul>
<li><a href="#sec-1-12-1">1.12.1. <span class="todo TODO">TODO</span> sign up <code>[%]</code></a></li>
</ul>
</li>
<li><a href="#sec-1-13">1.13. Course material and communications</a></li>
<li><a href="#sec-1-14">1.14. Assessment</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Lecture 1</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> History of writing</h3>
<div class="outline-text-3" id="text-1-1">
<p>
First example- Jiahu 5000BCE
</p>

<p>
A huge spike in the number of books Europe after the invention of the printing press
</p>

<p>
Google estimates that there about 130 million books in 2010
</p>

<p>
About 14.3 trillion web pages, 48 billion of which are indexed by Google
</p>

<p>
143199 tweets a second in 2013 in Japan
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> How to automatically process such huge amounts of data</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Take this class
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Topic 1: Information retrieval</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Boolean retrieval</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Are words present?
</p>

<p>
Not good enough
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Topic 2: Machine learning</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Naive Bayes
</p>

<p>
Textual classification using Vector Space Model
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Topic 3: Social media analysis</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Computation social media and networks
</p>

<p>
Computing network metrics and community detection
</p>

<p>
Link prediction and visualisation
</p>

<p>
Sentiment analysis
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Topic 4: NLP</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Preprocessing
</p>

<p>
Language modelling
</p>

<p>
Vector semantics
</p>

<p>
Syntax and parsing
</p>

<p>
Compositional semantics and NLP in practice
</p>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Topic 5: Information extraction</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Introduction to IE
</p>

<p>
HMM (Hidden Markov models) and CRF
</p>

<p>
Automatic summarisation
</p>

<p>
IE in practice
</p>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> What other applications</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Plenty - Question answering, information synthesis, trend analysis,
machine translation, sentiment analysis&#x2026;
</p>

<p>
Answer a business intelligence question (e.g "Why aren't people buying my product")
</p>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Course logistics</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Read the course outline
</p>

<p>
4 lecturers, questions about admin go to Marian-Andrei Rizolu 
or Lexing Xie (course convener)
</p>

<p>
Ask questions on Wattle unless it's a private matter
</p>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Textbook</h3>
<div class="outline-text-3" id="text-1-10">
<p>
First and third available online
</p>

<p>
Introduction to information retrieval
</p>

<p>
Speech and Language Processing: An introduction to natural language
processing, computational linguistics and speech recognition
(Find the draft of the third edition online)
</p>

<p>
Networks, Crowds and Markets: Reasoning about a highly connected world
</p>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> Lectures</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Mon 2pm-3pm and Tue 12pm-1pm
</p>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> Labs</h3>
<div class="outline-text-3" id="text-1-12">
<p>
There are 10 labs starting week 2
</p>
</div>
<div id="outline-container-sec-1-12-1" class="outline-4">
<h4 id="sec-1-12-1"><span class="section-number-4">1.12.1</span> <span class="todo TODO">TODO</span> sign up <code>[%]</code></h4>
<div class="outline-text-4" id="text-1-12-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Enroll in a lab tomorrow
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> Course material and communications</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Everything on Wattle
</p>
</div>
</div>

<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> Assessment</h3>
<div class="outline-text-3" id="text-1-14">
<p>
5 Assignments (one per topic)
</p>

<p>
In python (yay?) Nope, it's 2
</p>

<p>
Final exam worth 50%
</p>

<p>
Two weeks to finish assignment (except NLP)
</p>

<p>
Written questions are submitted to Wattle
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robert 'Probie' Offner</p>
<p class="date">Created: 2017-07-24 Mon 21:12</p>
<p class="creator"></p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
